Repository: starmastar1126/Queen_Xibo
Catalog: server/locale/*/LC_MESSAGES/default.po
Languages: fr_fr

source: Xibo requires PHP 5.0.2 or later
fr_fr: Xibo requiert PHP 5.0.2 ou supérieur

source: Welcome to the Xibo Installer!
fr_fr: Bienvenue dans l'installation de Xibo !

source: The installer will take you through setting up Xibo one step at a time.
fr_fr: Le programme d'installation va vous permettre de configurer Xibo par étape.

source: Lets get started!
fr_fr: C'est parti !

source: Next
fr_fr: Suivant

source: First we need to check if your server meets Xibo's requirements.
fr_fr: Nous devons tout d'abord vérifier si votre serveur réponds aux exigences de Xibo.

source: Filesystem Permissions
fr_fr: Permissions sur les fichiers

source: Xibo needs to be able to write to the following
fr_fr: Xibo doit être en mesure d'écrire dans les fichiers suivants

source: Please fix this, and retest.
fr_fr: Merci de corriger ceci, et relancer le test.

source: PHP Version
fr_fr: Version de PHP

source: Xibo requires PHP version 5 or later.
fr_fr: Xibo a besoin d'une version PHP 5 ou supérieur.

source: PHP MySQL Extension
fr_fr: Extension MySQL pour PHP

source: Xibo needs to access a MySQL database to function.
fr_fr: Xibo a besoin d'accéder à la base de données MySQL pour fonctionner.

source: Please install MySQL and the appropriate MySQL extension and retest.
fr_fr: Merci d'installer MySQL et l'extension appropriée et relancer le test.

source: PHP JSON Extension
fr_fr: Extension JSON pour PHP

source: Xibo needs the PHP JSON extension to function.
fr_fr: Xibo a besoin de l'extension JSON pour PHP pour fonctionner.

source: Please install the PHP JSON extension and retest.
fr_fr: Merci d'installer l'extension JSON pour PHP et relancer le test.

source: PHP GD Extension
fr_fr: Extension GD pour PHP

source: Xibo needs to manipulate images to function.
fr_fr: Xibo a besoin de manipuler des images pour fonctionner.

source: Please install the GD libraries and extension and retest.
fr_fr: Merci d'installer les librairies et l'extension GD et relancer le test.

source: PHP Calendar Extension
fr_fr: Extension PHP Calendar

source: Xibo needs the calendar extension to function.
fr_fr: Xibo a besoin de l'extension PHP Calendar pour fonctionner.

source: Please install the calendar extension and retest.
fr_fr: Merci d'installer l'extension PHP Calendar et relancer le test.

source: Retest
fr_fr: Réessayer

source: Xibo needs to setup a new database.
fr_fr: Xibo a besoin de configurer une nouvelle base de données

source: If you have not yet created an empty database and database user for Xibo to use, and know the username/password of a MySQL administrator, click the "Create New" button, otherwise click "Use Existing".
fr_fr: Si vous n'avez pas créé de base de données et utilisateur pour Xibo et que vous connaissez l'utilisateur / mot de passe pour l'administration de Mysql, vous pouvez cliquer sur le bouton "Créer nouveau" ou sinon ciquer sur le bouton "Utiliser existant".

source: Note that any existing database must be empty
fr_fr: Noter que la base de données existante doit être vide

source: Create New
fr_fr: Créer un nouvelle base

source: Use Existing
fr_fr: Utiliser une base données existante

source: Since no empty database has been created for Xibo to use, we need the username and password of a MySQL administrator to create a new database, and database user for Xibo.
fr_fr: Si aucune base de données vide n'as été créée pas Xibo, nous avons besoin de l'utilisateur et le mot de passe de l'administrateur MySQL pour créer une nouvelle base de données et l'utilisateur Xibo

source: Additionally, please give us a new username and password to create in MySQL for Xibo to use. Xibo will create this automatically for you.
fr_fr: En plus, merci de nous donner un nouveau nom d'utilisateur et mot de passe pour créer l'utilisateur Xibo dans MySQL. Xibo le créera automatiquement pour vous.

source: Host:
fr_fr: Hôte :

source: Admin Username:
fr_fr: Nom de l'administrateur :

source: Admin Password:
fr_fr: Mot de passe de l'administrateur :

source: Xibo Database Name:
fr_fr: Nom de la base Xibo :

source: Xibo Database Username:
fr_fr: Nom d'utilisateur de la base Xibo :

source: Xibo Database Password:
fr_fr: Mot de passe de la base Xibo :

source: Create
fr_fr: Créer

source: Please enter the details of the database and user you have created for Xibo.
fr_fr: Merci d'entrer les informations concernant la base de données et de l'utilisateur que vous avez créé pour Xibo.

source: Something went wrong
fr_fr: Quelque chose ne marche pas

source: A field was blank. Please fill in all fields.
fr_fr: Un champ est vide. Merci de remplir tous les champs.

source: Could not connect to MySQL with the administrator details. Please check and try again.
fr_fr: Impossible de ce connecter à MySQL avec les informations administrateurs. Merci de vérifier et de réessayer.

source: MySQL Error:
fr_fr: Erreur MySQL

source: Creating new database.
fr_fr: Création de la base de données

source: Could not create a new database with the administrator details. Please check and try again.
fr_fr: Impossible de créer une nouvelle base de données avec les informations administrateur. Merci de vérifier et de réessayer.

source: Creating new user
fr_fr: Création d'un nouvel utilisateur

source: Could not create a new user with the administrator details. Please check and try again.
fr_fr: Impossible de créer une nouvelle base de données avec les informations administrateur. Merci de vérifier et de réessayer.

source: Could not connect to MySQL with the Xibo User account details. Please check and try again.
fr_fr: Impossible de se conencter à MySQL avec les informations du compte utilisateur Xibo. merci de vérifier et de réessayer.

source: An error occured populating the database.
fr_fr: Une erreur est apparue durant le remplissage de la base de données

source: Unable to write to settings.php. We already checked this was possible earlier, so something changed.
fr_fr: Impossible d'écrire dans le fichier settings.php . Nous avons déjà vérifier plus tôt, mais quelques chose à changer.

source: Xibo needs to set the "xibo_admin" user password. Please enter a password for this account below.
fr_fr: Xibo a besoin de définir le mot de passe de l'utilisateur "xibo_admin". Merci de rentrer un mot de passe pour ce compte ci-dessous.

source: Password:
fr_fr: Mot de passe :

source: Retype Password:
fr_fr: Retaper le mot de passe :

source: Please input a new password. Ensure both password fields are identical.
fr_fr: Merci d'entrer un nouveau mot de passe. Veiller à ce que le mot de passe des deux champs sont identiques.

source: Could not connect to MySQL with the Xibo User account details saved in settings.php. Please check and try again.
fr_fr: Impossible de se connecter à MySQL avec les informations de l'utilisateur Xibo sauvées dans settings.php . Merci de vérifier et réessayer.

source: An error occured changing the xibo_admin password.
fr_fr: Une erreur est apparue durant le changement du mot de passe de xibo_admin

source: Successfully changed the xibo_admin password. We're nearly there now. Just a couple more steps!
fr_fr: Mot de passe de xibo_admin changé avec succès. Nous sommes pas loin maintenant. Juste quelques étapes de plus !

source: Library Location
fr_fr: Répertoire de la Librairie

source: Xibo needs somewhere to store the things you upload to be shown. Ideally, this should be somewhere outside the root of your webserver - that is such that is not accessible by a web browser. Please input the full path to this folder. If the folder does not already exist, Xibo will attempt to create it for you.
fr_fr: Xibo besoins de stocker quelque part les contenus à diffuser que vous téléchargez. Idéalement, ce devrait être quelque part en dehors de la racine de votre serveur web afin qu'il ne soit pas accessible par un navigateur Web. S'il vous plaît entrez le chemin d'accès complet à ce dossier. Si le dossier n'existe pas, Xibo va tenter de le créer pour vous.

source: Library Location:
fr_fr: Répertoire de la Librairie :

source: Server Key
fr_fr: Clef du serveur

source: Xibo needs you to choose a "key". This will be required each time you setup a new client. It should be complicated, and hard to remember. It is visible in the admin interface, so it need not be written down separately.
fr_fr: Xibo a besoin que vous choisissiez une "clef". elle sera nécessaire à chaque fois que vous installerez un nouveau client. Elle devrait être compliquée et difficile à mémoriser. Elle est visible dans l'interface d'administration, de sorte qu'il n'a pas besoin d'être écrites ailleurs.

source: Server Key:
fr_fr: Clef du serveur :

source: Statistics
fr_fr: Statistiques

source: We'd love to know you're running Xibo. If you're happy for us to collect anonymous statistics (version number, number of displays) then please leave the box ticked. Please untick the box if your server does not have direct access to the internet.
fr_fr: Nous serions ravis de savoir que vous utilisez Xibo. Si vous êtes heureux pour nous de recueillir des statistiques anonymes (numéro de version, nombre d'écrans) alors merci de laisser la case cochée. Merci de décochée la case si le serveur n'as pas de connexion direct à l'Internet.

source: Anonymous Statistics:
fr_fr: Statistiques anonymes :

source: A field was blank. Please make sure you complete all fields
fr_fr: Un champ est vide. Merci de remplir tous les champs

source: A file exists with the name you gave for the Library Location. Please choose another location
fr_fr: Un fichier existe avec le nom que vous avez donné à la l'emplacement de la Bibliothèque. Merci de choisir un autre emplacement

source: Could not create the Library Location directory for you. Please ensure the webserver has permission to create a folder in this location, or create the folder manually and grant permission for the webserver to write to the folder.
fr_fr: Impossible de créer l'emplacement pour la Bibliothèque. Merci de vérifier que le serveur web a bien les permissions pour créer un répertoire dans cet emplacement, ou sinon créé le répertoire manuellement et donnez lui les permissions d'écriture pour que le serveur web puisse écrire dans cet emplacement.

source: The Library Location you gave is not writable by the webserver. Please fix the permissions and try again.
fr_fr: Le serveur web ne peut écrire dans l'emplacement que vous avez donné pour la Bibliothèque. Merci de corriger les permissions et réessayer.

source: The Library Location you gave is not empty. Please give the location of an empty folder
fr_fr: L'emplacement pour la Bibliothèque n'est pas vide. Merci de donner un répertoire vide pour l'emplacement

source: An error occured changing the library location.
fr_fr: Une erreur est apparue durant le changement de l'emplacement de la Bibliothèque.

source: An error occured changing the server key.
fr_fr: Une erreur est apparue durant le changement de la clef serveur.

source: An error occured setting the default timezone.
fr_fr: Une erreur est apparue durant la configuration du fuseau horaire par défaut.

source: An error occured setting anonymous statistics.
fr_fr: Une erreur est apparue lors de la configuration des statistiques anonymes.

source: Successfully set library location and server key.
fr_fr: L'emplacement de la Bibliothèque et la clef serveur ont été configuré avec succès

source: Unable to delete install.php. Please ensure the webserver has permission to unlink this file and retry
fr_fr: Impossible de supprimer install.php . Merci de verifier que le serveur web a les permissions suffisante pour supprimer ce fichier et réessayer

source: Retry
fr_fr: Réessayer

source: Unable to delete upgrade.php. Please ensure the webserver has permission to unlink this file and retry
fr_fr: Impossible de supprimer upgrade.php . Merci de vérifier que le serveur web a les permissions suffisante pour supprimer ce fichier et réessayer

source: Xibo was successfully installed.
fr_fr: Xibo a été installer avec succès

source: Please click
fr_fr: Merci de cliquer

source: here
fr_fr: ici

source: to logon to Xibo as "xibo_admin" with the password you chose earlier.
fr_fr: pour se connecter à Xibo avec "xibo_admin" avec le mot de passe choisit plus tôt

source: A required parameter was missing. Please go through the installer sequentially!
fr_fr: Un paramètre requis est manquant. Merci de passer par l'installation séquentiel !

source: Start Again
fr_fr: Recommencer
